{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "metadata": {
                "description": "Log Analytics Workspace Name"
            },
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers/', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ad03fc9d-3578-41b6-a8ce-8d1b84aae5b0')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ad03fc9d-3578-41b6-a8ce-8d1b84aae5b0')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT12H",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "URL"
                        ],
                    "groupByAlertDetails": [],
                    "groupByCustomDetails": [
                        "Cliente"
                    ]
                }
            },
            "customDetails": {
                "Cliente": "TenantDetection"
            },
            "entityMappings": [
                {
                    "entityType": "URL",
                    "fieldMappings": [
                        {
                            "identifier": "Url",
                            "columnName": "IncidentNumber"
                        }
                    ]
                }
            ],
            "queryFrequency": "PT2H",
            "queryPeriod": "PT2H",
            "triggerOperator": "GreaterThan",
            "triggerThreshold": 0,
            "eventGroupingSettings": {
                "aggregationKind": "AlertPerResult"
            },
            "severity": "Medium",
            "query": "let Mango = view () {\n    workspace(\"4d082081-7c2a-4f57-b848-bd64e5c72859\").SecurityIncident\n    | where ProviderName == \"Microsoft 365 Defender\" and Severity == \"Medium\" and Status in (\"New\")\n}; \nunion withsource=\"TenantDetection\"  Mango\n",
            "suppressionDuration": "PT5H",
            "suppressionEnabled": false,
        "tactics": [],
        "displayName": "UC051670 - 365 Defender Medium Severity Alert Detection",
        "enabled": true,
        "description": "365 Defender Medium Severity Alert Detection",
        "alertRuleTemplateName": null
    },
    "apiVersion": "2021-09-01-preview"
}
]
}
