{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "metadata": {
                "description": "Log Analytics Workspace Name"
            },
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers/', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/73b660cb-0aef-421b-a84f-80ccf89e5850')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/73b660cb-0aef-421b-a84f-80ccf89e5850')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "P1D",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "Account"
                        ],
                    "groupByAlertDetails": [],
                    "groupByCustomDetails": [
                        "Cliente"
                    ]
                }
            },
            "customDetails": {
                "Cliente": "TenantDetection"
            },
            "entityMappings": [
                {
                    "entityType": "Account",
                    "fieldMappings": [
                        {
                            "identifier": "Name",
                            "columnName": "SubjectUserName"
                        }
                    ]
                }
            ],
            "queryFrequency": "PT15M",
            "queryPeriod": "PT15M",
            "triggerOperator": "GreaterThan",
            "triggerThreshold": 0,
            "eventGroupingSettings": {
                "aggregationKind": "AlertPerResult"
            },
            "severity": "Low",
            "query": "let Mango = view () {\n    let DomainAdminsList = Mango_DomainAdmins | project samAccountName;\n    let SubjectUserNameExclusion = Mango_UC051691_exclusion_SubjectUserName | project SubjectUserName;\n    workspace(\"4d082081-7c2a-4f57-b848-bd64e5c72859\").SecurityEvent\n    | where EventID in (4727, 4731, 4744, 4749, 4754, 4759)\n    // Extract SubjectUserName from RAW data because sometimes the field \"SubjectUserName\" comes empty\n    | parse EventData with *'\"SubjectUserName\">' SubjectUserName '</Data>'*\n    // If SubjectUserName contains the domain (like CLIENT\\user_name), we'll keep only the username to be able to check it against Domain Admins lookup\n    | extend SubjectUserName = split(SubjectUserName,'\\\\')\n    | extend SubjectUserName = iff(array_length(SubjectUserName) > 1, SubjectUserName[1], SubjectUserName[0])\n    // We do the same removing @CLIENT.DOMAIN\n    | extend SubjectUserName = split(SubjectUserName,'@')[0]\n    | where SubjectUserName !in (DomainAdminsList) and isnotempty(SubjectUserName)\n    | where SubjectUserName !in (SubjectUserNameExclusion)\n};\nunion withsource=\"TenantDetection\" Mango",
            "suppressionDuration": "PT5H",
            "suppressionEnabled": false,
        "tactics": [],
        "displayName": "UC051691 - Group creation by unauthorized user",
        "enabled": true,
        "description": "Detects when an user who does not belong to Domain Admins group creates a group. Event IDs 4727, 4731, 4744, 4749, 4754, 4759.",
        "alertRuleTemplateName": null
    },
    "apiVersion": "2021-09-01-preview"
}
]
}
