{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "metadata": {
                "description": "Log Analytics Workspace Name"
            },
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers/', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/0bfc56ad-2f0e-4254-9b4c-b4d55b7bd1f2')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/0bfc56ad-2f0e-4254-9b4c-b4d55b7bd1f2')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "P1D",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "Account"
                        ],
                    "groupByAlertDetails": [],
                    "groupByCustomDetails": [
                        "Cliente"
                    ]
                }
            },
            "customDetails": {
                "Cliente": "TenantDetection"
            },
            "entityMappings": [
                {
                    "entityType": "Account",
                    "fieldMappings": [
                        {
                            "identifier": "Name",
                            "columnName": "Account"
                        }
                    ]
                }
            ],
            "queryFrequency": "PT15M",
            "queryPeriod": "PT15M",
            "triggerOperator": "GreaterThan",
            "triggerThreshold": 0,
            "eventGroupingSettings": {
                "aggregationKind": "AlertPerResult"
            },
            "severity": "Medium",
            "query": "let Mango = view () {\n    workspace(\"4d082081-7c2a-4f57-b848-bd64e5c72859\").SecurityEvent\n    | where EventID == 4771 and IpPort in (range(1, 1023))\n};\nunion withsource=\"TenantDetection\" Mango",
            "suppressionDuration": "PT5H",
            "suppressionEnabled": false,
        "tactics": [],
        "displayName": "UC051695 - Pre-authentication failed from well-known port",
        "enabled": true,
        "description": "Detects any failed kerberos pre-authentication (Event ID 4771) from a well-known port (greater than 0 and less than 1024). Those ports should be system reserved and are not expected to be used to log in.",
        "alertRuleTemplateName": null
    },
    "apiVersion": "2021-09-01-preview"
}
]
}
