{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "metadata": {
                "description": "Log Analytics Workspace Name"
            },
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers/', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/e6ef5189-f4a0-4671-8f48-e1584ad8857b')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/e6ef5189-f4a0-4671-8f48-e1584ad8857b')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "P1D",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "Account"
                        ],
                    "groupByAlertDetails": [],
                    "groupByCustomDetails": [
                        "Cliente"
                    ]
                }
            },
            "customDetails": {
                "Cliente": "TenantDetection"
            },
            "entityMappings": [
                {
                    "entityType": "Account",
                    "fieldMappings": [
                        {
                            "identifier": "Name",
                            "columnName": "samAccountName"
                        }
                    ]
                }
            ],
            "queryFrequency": "PT15M",
            "queryPeriod": "PT15M",
            "triggerOperator": "GreaterThan",
            "triggerThreshold": 0,
            "eventGroupingSettings": {
                "aggregationKind": "AlertPerResult"
            },
            "severity": "Low",
            "query": "let Mango = view () {\n    let VIPList = Mango_VIP_Users | project samAccountName;\n    workspace(\"4d082081-7c2a-4f57-b848-bd64e5c72859\").SecurityEvent\n    | where EventID == 4769\n    // Extract TargetUserName from RAW data because sometimes the field \"Account\" comes empty\n    | parse EventData with *'\"TargetUserName\">' TargetUserName '</Data>'*\n    | parse EventData with *'<Data Name=\"Status\">' Status '</Data>'*\n    // If TargetUserName contains the domain (like CLIENT\\user_name), we'll keep only the username to be able to check it against VIP lookup\n    | extend samAccountName = split(TargetUserName,'\\\\')\n    | extend samAccountName = iff(array_length(samAccountName) > 1, samAccountName[1], samAccountName[0])\n    // We do the same removing @CLIENT.DOMAIN\n    | extend samAccountName = split(samAccountName,'@')[0]\n    | where samAccountName in (VIPList) and isnotempty(samAccountName)\n    | where Status != \"0x0\"\n    | summarize occurrences = count() by tostring(samAccountName)\n    | where occurrences >= 45\n};\nunion withsource=\"TenantDetection\" Mango",
            "suppressionDuration": "PT5H",
            "suppressionEnabled": false,
        "tactics": [],
        "displayName": "UC051688 - User TGS request error increase VIP",
        "enabled": true,
        "description": "Detects failed kerberos service request (event ID 4769) on repeated occasions by a user who does belong to the VIP list.",
        "alertRuleTemplateName": null
    },
    "apiVersion": "2021-09-01-preview"
}
]
}
