{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "metadata": {
                "description": "Log Analytics Workspace Name"
            },
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers/', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/ea7bacb4-d82d-47c9-a6f6-31523e05ecd6')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/ea7bacb4-d82d-47c9-a6f6-31523e05ecd6')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "P1D",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "Account",
                            "IP"
                        ],
                    "groupByAlertDetails": [],
                    "groupByCustomDetails": [
                        "Cliente"
                    ]
                }
            },
            "customDetails": {
                "Cliente": "TenantDetection"
            },
            "entityMappings": [
                {
                    "entityType": "Account",
                    "fieldMappings": [
                        {
                            "identifier": "FullName",
                            "columnName": "UserIdentityPrincipalid"
                        }
                    ]
                },
                {
                    "entityType": "IP",
                    "fieldMappings": [
                        {
                            "identifier": "Address",
                            "columnName": "SourceIpAddress"
                        }
                    ]
                }
            ],
            "queryFrequency": "PT15M",
            "queryPeriod": "PT15M",
            "triggerOperator": "GreaterThan",
            "triggerThreshold": 0,
            "eventGroupingSettings": {
                "aggregationKind": "AlertPerResult"
            },
            "severity": "Low",
            "query": "let IP_Data = IPv4_Country_Ranges;\nlet Mango = view () {\n    workspace(\"4d082081-7c2a-4f57-b848-bd64e5c72859\").AWSCloudTrail\n    | where EventName == \"CreateUser\" and UserIdentityType == \"IAMUser\"\n    | where not(ipv4_is_private(SourceIpAddress))\n    | evaluate ipv4_lookup(IP_Data, SourceIpAddress, network, return_unmatched = true)\n    | summarize count() by SourceIpAddress, country_iso_code, UserIdentityPrincipalid, UserIdentityArn\n    | where country_iso_code != \"ES\"\n};\nunion withsource=\"TenantDetection\" Mango",
            "suppressionDuration": "PT5H",
            "suppressionEnabled": false,
        "tactics": [],
        "displayName": "UC050965 - CloudTrail AWS IAM user creation from outside Spain",
        "enabled": true,
        "description": "Creación de un usuario IAM en AWS desde una dirección IP de fuera de España.",
        "alertRuleTemplateName": null
    },
    "apiVersion": "2021-09-01-preview"
}
]
}
