{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "metadata": {
                "description": "Log Analytics Workspace Name"
            },
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers/', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/a8dfd28a-9884-4206-b9e5-466ea9db83de')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/a8dfd28a-9884-4206-b9e5-466ea9db83de')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "P1D",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "Account"
                        ],
                    "groupByAlertDetails": [],
                    "groupByCustomDetails": [
                        "Cliente"
                    ]
                }
            },
            "customDetails": {
                "Cliente": "TenantDetection"
            },
            "entityMappings": [
                {
                    "entityType": "Account",
                    "fieldMappings": [
                        {
                            "identifier": "FullName",
                            "columnName": "DestinationUserName"
                        }
                    ]
                }
            ],
            "queryFrequency": "PT15M",
            "queryPeriod": "PT15M",
            "triggerOperator": "GreaterThan",
            "triggerThreshold": 0,
            "eventGroupingSettings": {
                "aggregationKind": "AlertPerResult"
            },
            "severity": "Low",
            "query": "let Mango = view () {\n    workspace(\"4d082081-7c2a-4f57-b848-bd64e5c72859\").CommonSecurityLog \n    | where DeviceVendor == \"Thycotic Software\"\n    | where SourceUserName != \"ThycoticSystem\" // Solicitado por el cliente detección - 693094 \n        and Activity contains \"USER\"\n        and (Activity contains \"EDIT\" or Activity contains \"CREATE\" or Activity contains \"DISABLE\" or Activity contains \"REMOVE\" or Activity contains \"DELETE\")\n};\nunion withsource=\"TenantDetection\" Mango",
            "suppressionDuration": "PT5H",
            "suppressionEnabled": false,
        "tactics": [],
        "displayName": "UC070133 - PAM User administration actions",
        "enabled": true,
        "description": "Borrado, edición o creación de usuarios en PAM.",
        "alertRuleTemplateName": null
    },
    "apiVersion": "2021-09-01-preview"
}
]
}
