{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "metadata": {
                "description": "Log Analytics Workspace Name"
            },
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers/', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/3d528098-d13b-4fa2-a8fd-cfc69e075650')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/3d528098-d13b-4fa2-a8fd-cfc69e075650')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "P1D",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "Account"
                        ],
                    "groupByAlertDetails": [],
                    "groupByCustomDetails": [
                        "Cliente"
                    ]
                }
            },
            "customDetails": {
                "Cliente": "TenantDetection"
            },
            "entityMappings": [
                {
                    "entityType": "Account",
                    "fieldMappings": [
                        {
                            "identifier": "Name",
                            "columnName": "TargetUserName"
                        }
                    ]
                }
            ],
            "queryFrequency": "PT15M",
            "queryPeriod": "PT15M",
            "triggerOperator": "GreaterThan",
            "triggerThreshold": 0,
            "eventGroupingSettings": {
                "aggregationKind": "AlertPerResult"
            },
            "severity": "High",
            "query": "let Mango = view () {\n    let DomainAdminsList = Mango_DomainAdmins | project samAccountName;\n    let VIPList = Mango_VIP_Users | project samAccountName;\n    workspace(\"4d082081-7c2a-4f57-b848-bd64e5c72859\").SecurityEvent\n    | where EventID == 4725\n    // Extract TargetUserName from RAW data because sometimes the field \"TargetUserName\" comes empty\n    | parse EventData with *'\"TargetUserName\">' TargetUserName '</Data>'*\n    // If TargetUserName contains the domain (like CLIENT\\user_name), we'll keep only the username to be able to check it against lookup\n    | extend TargetUserName = split(TargetUserName,'\\\\')\n    | extend TargetUserName = iff(array_length(TargetUserName) > 1, TargetUserName[1], TargetUserName[0])\n    // We do the same removing @CLIENT.DOMAIN\n    | extend TargetUserName = split(TargetUserName,'@')[0]\n    | where TargetUserName in~ (DomainAdminsList) or TargetUserName in~ (VIPList)\n};\nunion withsource=\"TenantDetection\" Mango",
            "suppressionDuration": "PT5H",
            "suppressionEnabled": false,
        "tactics": [],
        "displayName": "UC080323 - VIP user account disabled",
        "enabled": true,
        "description": "Triggers always that a user in the VIP or Domain Admin list is disabled (Event ID 4725).",
        "alertRuleTemplateName": null
    },
    "apiVersion": "2021-09-01-preview"
}
]
}
