{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "metadata": {
                "description": "Log Analytics Workspace Name"
            },
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers/', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/32b6422e-f112-4703-9d02-054bd829a032')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/32b6422e-f112-4703-9d02-054bd829a032')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": true,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "P1D",
                        "matchingMethod": "Selected",
                        "groupByEntities": [
                            "Account"
                        ],
                    "groupByAlertDetails": [],
                    "groupByCustomDetails": [
                        "Cliente"
                    ]
                }
            },
            "customDetails": {
                "Cliente": "TenantDetection"
            },
            "entityMappings": [
                {
                    "entityType": "Account",
                    "fieldMappings": [
                        {
                            "identifier": "FullName",
                            "columnName": "UserId"
                        }
                    ]
                }
            ],
            "queryFrequency": "PT1H",
            "queryPeriod": "PT1H",
            "triggerOperator": "GreaterThan",
            "triggerThreshold": 0,
            "eventGroupingSettings": {
                "aggregationKind": "AlertPerResult"
            },
            "severity": "Medium",
            "query": "let Mango = view () {\r\nworkspace(\"4d082081-7c2a-4f57-b848-bd64e5c72859\").OfficeActivity\r\n| where (Operation==\"UpdateInboxRules\" or Operation==\"Forward\") | where OperationProperties[6].Value!=\"[]\" \r\n| where parse_json(tostring(OperationProperties[6].Value))[0].ActionType == \"Forward\"\r\n| where parse_json(tostring(parse_json(tostring(OperationProperties[6].Value))[0].Recipients))[0] !contains \"@mango.com\" \r\n};\r\nunion withsource=\"TenantDetection\"  Mango\r\n",
            "suppressionDuration": "PT5H",
            "suppressionEnabled": false,
        "tactics": [],
        "displayName": "UC080210 - Forwarding to an external recipient by a user",
        "enabled": true,
        "description": "",
        "alertRuleTemplateName": null
    },
    "apiVersion": "2021-09-01-preview"
}
]
}
