{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "workspace": {
            "metadata": {
                "description": "Log Analytics Workspace Name"
            },
            "type": "String"
        }
    },
    "resources": [
        {
            "id": "[concat(resourceId('Microsoft.OperationalInsights/workspaces/providers/', parameters('workspace'), 'Microsoft.SecurityInsights'),'/alertRules/6b840143-d61b-4e26-985b-b05df6d0c224')]",
            "name": "[concat(parameters('workspace'),'/Microsoft.SecurityInsights/6b840143-d61b-4e26-985b-b05df6d0c224')]",
            "type": "Microsoft.OperationalInsights/workspaces/providers/alertRules",
            "kind": "Scheduled",
            "properties": {
                "incidentConfiguration": {
                    "createIncident": true,
                    "groupingConfiguration": {
                        "enabled": false,
                        "reopenClosedIncident": false,
                        "lookbackDuration": "PT5H",
                        "matchingMethod": "AllEntities",
                    "groupByEntities": [],
                "groupByAlertDetails": [],
            "groupByCustomDetails": []
        }
    },
    "entityMappings": [
        {
            "entityType": "Account",
            "fieldMappings": [
                {
                    "identifier": "FullName",
                    "columnName": "UserPrincipalName"
                }
            ]
        },
        {
            "entityType": "IP",
            "fieldMappings": [
                {
                    "identifier": "Address",
                    "columnName": "SuccessIPAddress"
                }
            ]
        },
        {
            "entityType": "IP",
            "fieldMappings": [
                {
                    "identifier": "Address",
                    "columnName": "FailedIPAddress"
                }
            ]
        }
    ],
    "queryFrequency": "P1D",
    "queryPeriod": "P1D",
    "triggerOperator": "GreaterThan",
    "triggerThreshold": 0,
    "eventGroupingSettings": {
        "aggregationKind": "SingleAlert"
    },
    "severity": "Medium",
    "query": "let logonDiff = 5s;\r\nlet Mango = view () {\r\nlet aadSignin = \r\nworkspace(\"4d082081-7c2a-4f57-b848-bd64e5c72859\").SigninLogs\r\n| where ResultType == \"0\" \r\n| where AppDisplayName !in (\"Office 365 Exchange Online\", \"Skype for Business Online\")\r\n| project SuccessLogonTime = TimeGenerated, UserPrincipalName, SuccessIPAddress = IPAddress, AppDisplayName, SuccessIPBlock = strcat(split(IPAddress, \".\")[0], \".\", split(IPAddress, \".\")[1]), Type\r\n| join kind= inner (\r\n    workspace(\"4d082081-7c2a-4f57-b848-bd64e5c72859\").SigninLogs\r\n    | where ResultType !in (\"0\", \"50140\") \r\n    | where ResultDescription !~ \"Other\"  \r\n    | where AppDisplayName !in (\"Office 365 Exchange Online\", \"Skype for Business Online\")\r\n    | project FailedLogonTime = TimeGenerated, UserPrincipalName, FailedIPAddress = IPAddress, AppDisplayName, ResultType, ResultDescription, Type\r\n) on UserPrincipalName, AppDisplayName \r\n| where SuccessLogonTime < FailedLogonTime and FailedLogonTime - SuccessLogonTime <= logonDiff and FailedIPAddress !startswith SuccessIPBlock\r\n| summarize FailedLogonTime = max(FailedLogonTime), SuccessLogonTime = max(SuccessLogonTime) by UserPrincipalName, SuccessIPAddress, AppDisplayName, FailedIPAddress, ResultType, ResultDescription, Type\r\n| extend timestamp = SuccessLogonTime;\r\nlet aadNonInt = \r\nworkspace(\"4d082081-7c2a-4f57-b848-bd64e5c72859\").AADNonInteractiveUserSignInLogs\r\n| where ResultType == \"0\" \r\n| where AppDisplayName !in (\"Office 365 Exchange Online\", \"Skype for Business Online\")\r\n| project SuccessLogonTime = TimeGenerated, UserPrincipalName, SuccessIPAddress = IPAddress, AppDisplayName, SuccessIPBlock = strcat(split(IPAddress, \".\")[0], \".\", split(IPAddress, \".\")[1]), Type\r\n| join kind= inner (\r\n    workspace(\"4d082081-7c2a-4f57-b848-bd64e5c72859\").AADNonInteractiveUserSignInLogs\r\n    | where ResultType !in (\"0\", \"50140\") \r\n    | where ResultDescription !~ \"Other\"  \r\n    | where AppDisplayName !in (\"Office 365 Exchange Online\", \"Skype for Business Online\")\r\n    | project FailedLogonTime = TimeGenerated, UserPrincipalName, FailedIPAddress = IPAddress, AppDisplayName, ResultType, ResultDescription, Type\r\n) on UserPrincipalName, AppDisplayName \r\n| where SuccessLogonTime < FailedLogonTime and FailedLogonTime - SuccessLogonTime <= logonDiff and FailedIPAddress !startswith SuccessIPBlock\r\n| summarize FailedLogonTime = max(FailedLogonTime), SuccessLogonTime = max(SuccessLogonTime) by UserPrincipalName, SuccessIPAddress, AppDisplayName, FailedIPAddress, ResultType, ResultDescription, Type\r\n| extend timestamp = SuccessLogonTime;\r\nunion isfuzzy=true aadSignin, aadNonInt\r\n};\r\nunion withsource=\"TenantDetection\" Mango",
    "suppressionDuration": "PT5H",
    "suppressionEnabled": false,
    "tactics": [
        "CredentialAccess",
        "InitialAccess"
    ],
    "displayName": "UCMA050202 - Successful logon from IP and failure from a different IP",
    "enabled": true,
    "description": "Identifies when a user account successfully logs onto an Azure App from one IP and within 5 seconds failed to logon to the same App via a different IP.\nThis may indicate a malicious attempt at password guessing based on knowledge of the users account.",
    "alertRuleTemplateName": null
},
"apiVersion": "2021-09-01-preview"
}
]
}
